#define _CRT_SECURE_NO_WARNINGS 1 
//整形家族:
//字符存储的时候存储的是ASCII的值,ASCII是整数
//char是signed char还是unsigned char取决于编译器
//char
//unsigned char
//signed char
//short
//unsigned short[int]
//signed short[int]
//int
//unsigned int
//signed int
//long
//unsigned long[int]
//signed long[int]


//空类型:
//void表示空类型(无类型)
//通常应用于函数的返回类型、函数的参数、指针类型
//原码
//直接将数值按照正负数的形式翻译成二进制就可以得到原码。
//反码
//将原码的符号位不变,其他位依次按位取反就可以得到反码。
//补码
//反码+1就得到补码
//#include <stdio.h>
//#define ROW 10
//void sort(int arr[ROW],int sz)
//{
//	int i = 0;
//	for (i = 0;i < sz - 1;i++)
//	{
//		int j = 0;
//		for (j = 0;j < sz - 1 - i;j++)
//		{
//			if (arr[j] < arr[j + 1])
//			{
//				int temp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = temp;
//			}
//		}
//	}
//}
//int main() 
//{
//	int arr[ROW] = { 1,2,3,4,5,6,7,8,9,10 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	sort(arr, sz);
//	int i = 0;
//	for (i = 0;i < sz;i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	printf("\n");
//	return 0;
//}


//#include <stdio.h>
////定义一个不接受参数的函数
//void print(void) 
//{
//	printf("Hello World!\n");
//}
//int main() 
//{
//	print();
//	return 0;
//}


//#include <stdio.h>
//int main() 
//{
//    int num = 10;
//    char ch = 'A';
//    //定义一个void指针,并指向int类型的数据
//    void* ptr = &num;
//    //显式类型转换
//    int* intPtr = (int*)ptr;
//    printf("通过void指针访问int类型数据:%d\n", *intPtr);
//    ptr = &ch;
//    // 显式类型转换
//    char* charPtr = (char*)ptr;
//    printf("通过void指针访问char类型数据:%c\n", *charPtr);
//    return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int a = 20;
//	int b = -10;
//	//20
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000 00000000 00000000 0001 0100 - 补码
//	//0x 00       00       00       1    4
//	//-10
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//   11111111 11111111 11111111 1111 0110 - 补码
//	//0x ff       ff       ff       f    6
//	return 0;
//}


//在计算机系统中,数值一律用补码来表示和存储。
//使用补码,可以将符号位和数值域统一处理
//加法和减法也可以统一处理(CPU只有加法器)
//补码与原码相互转换,其运算过程是相同的,不需要额外的硬件电路
//原码 -- 反码 -- 补码 ----> 取反 +1
//补码 -- 反码 -- 原码 ----> 取反 +1 或者 -1 取反
//#include<stdio.h>
//int main()
//{
//	int a = 1;
//	int b = 1;
//	int c = a - b;
//	//1-1
//	//1+(-1)
//	//原码
//	//00000000000000000000000000000001 -- 1
//	//10000000000000000000000000000001 -- (-1)
//	//10000000000000000000000000000010
//	//-2
//	//补码
//	//00000000000000000000000000000001 -- 1
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 -- -1
//	//最高位截断
//	//100000000000000000000000000000000 -- 0
//	return 0;
//}


//void* 这是一种指针,无具体类型的指针
//大小端介绍
//大端(大端字节序存储)模式 --- 正着放(从小到大)
//数据的低位保存在内存的高地址中,而数据的高位,保存在内存的低地址中
//#include<stdio.h>
//int main()
//{
//	int a = 0x11223344;
//	return 0;
//}


//小端(小端字节序存储)模式 --- 倒着放(从大到小)
//数据的低位保存在内存的低地址中,而数据的高位,保存在内存的高地址中
//第1种方法
//#include <stdio.h>
//int check_sys()
//{
//	int i = 1;
//	char* pa = (char*)&i;
//	if (*pa)//取出i的地址,强制转换成char*,后解引用
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//第2种方法
//#include <stdio.h>
//int check_sys()
//{
//	int i = 1;
//	if (*(char*)&i)//取出i的地址,强制转换成char*,后解引用
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//第3种方法
//#include <stdio.h>
//int check_sys()
//{
//	int i = 1;
//	return *(char*)&i;//取出i的地址,强制转换成char*,后解引用
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//输出什么
//unsigned int范围 0 ~ 255
//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111 - a -- 截断之后
//	//11111111111111111111111111111111 - 提升
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 原码
//	signed char b = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111 - a -- 截断之后
//	//11111111111111111111111111111111 - 提升
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 原码
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111 - c -- 截断之后
//	//00000000000000000000000011111111 - 提升
//	//255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}


//%u --- 打印无符号数 --- 不讨论原码、反码和补码
//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000
//	//10000000 - a
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}


//负数的整形提升
//char c1 = -128;
//变量c1的二进制位(补码)中只有8个比特位：
//10000000
//因为char为有符号的char
//所以整形提升的时候,高位补充符号位(1),即为1
//提升之后的结果是：
//11111111111111111111111110000000
////正数的整形提升
//char c2 = -128;
//变量c2的二进制位(补码)中只有8个比特位：
//00000001
//因为char为有符号的char
//所以整形提升的时候,高位补充符号位，即为0
//提升之后的结果是:
//11111111111111111111111110000000
//无符号整形提升,高位补0
//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
//	//01111111111111111111111101111111
//	//01111111111111111111111110000000
//	//10000000 - a
//	//11111111111111111111111110000000
//	//10000000000000000000000001111111
//	//10000000000000000000000010000000
//	printf("%d\n", a);
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
//	//10000000 - a
//	//11111111111111111111111110000000
//	printf("%u\n", a);
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	
//	//00000000000000000000000000001010 --- 10的补码
//	//11111111111111111111111111101100 --- -20的补码
//	//11111111111111111111111111110110 --- i + j
//	//10000000000000000000000000001001 --- 取反
//	//10000000000000000000000000001010 --- -10
//	//-10
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	return 0;
//}


//#include<stdio.h>
//#include<Windows.h>
//int main()
//{
//	unsigned int i;
//	//int i;
//	//当i是-1时,二进制序列为11111111111111111111111111111111
//	for (i = 9; i >= 0; i--)//i不可能<0,所以无限循环
//	{
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//	return 0;
//}


//#include<stdio.h>
//#include<string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//'0' -- 0之前的元素 
//	//255
//	//-1 -2 ..... -127 -128 127 126 .... 2 1 0
//	return 0;
//}


//#include <stdio.h>
//unsigned char i = 0;
//int main()
//{
//	for (i = 0;i < 255;i++)//i无限循环
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}


//浮点型在内存中的存储
//没有原码、反码和补码的概念,只有整数有
//常见的浮点数:
//3.14159
//1E10
//浮点数家族包括:float、double、long double 类型。
//浮点数表示的范围:float.h中定义
//浮点数表示的范围:limits.h中定义
//任意一个二进制浮点数V可以表示成下面的形式:
//float存储模型(32位):S --- 1,E --- 8,M --- 23
//double存储模型(64位):S --- 1,E --- 11,M --- 52
//(-1)^S*M*2^E
//(-1)^S表示符号位,当S=0,V为正数;当S=1,V为负数。
//M表示有效数字,大于等于1,小于2。
//2^E表示指数位。
//5.5
//101.1 = 1.011 * 2 ^ 2//2进制
//(-1) ^ 0 * 1.011 * 2 ^ 2
//(-1) ^ S * M     * 2 ^ E
//只需将S、M和E存起来
//#include<limits.h>
//#include<float.h>
//#include<stdio.h>
//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为:%f\n", *pFloat);
//	*pFloat = 9.0;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为:%f\n", *pFloat);
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int n = 9;
//	//00000000000000000000000000001001
//	//0 00000000 00000000000000000001001
//	//(-1) ^ 0 * 0.00000000000000000001001 * 2 ^ -126
//	//E是一个很小的接近于0的正数,所以用十进制小数表示就是0.000000。
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为:%f\n", *pFloat);
//	*pFloat = 9.0;
//	//1001.0 * 2 ^ 3
//	//(-1) ^ 0 * 1.001 * 2 ^ 3
//	//s = 0
//	//e = 3
//	//m = 1.001
//	//0 10000010 00100000000000000000000
//	printf("n的值为:%d\n", n);
//	//0100 0001 0001 0000 0000 0000 0000 0000
//	//41 10 00 00
//	printf("*pFloat的值为:%f\n", *pFloat);
//	return 0;
//}#include<stdio.h>
//int main()
//{
//	int n = 9;
//	//00000000000000000000000000001001
//	//0 00000000 00000000000000000001001
//	//(-1) ^ 0 * 0.00000000000000000001001 * 2 ^ -126
//	//E是一个很小的接近于0的正数,所以用十进制小数表示就是0.000000。
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为:%f\n", *pFloat);
//	*pFloat = 9.0;
//	//1001.0 * 2 ^ 3
//	//(-1) ^ 0 * 1.001 * 2 ^ 3
//	//s = 0
//	//e = 3
//	//m = 1.001
//	//0 10000010 00100000000000000000000
//	printf("n的值为:%d\n", n);
//	//0100 0001 0001 0000 0000 0000 0000 0000
//	//41 10 00 00
//	printf("*pFloat的值为:%f\n", *pFloat);
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	float f = 5.5f;
//	//101.1
//	//(1.011) * 2 ^ 2	
//	//(-1) ^ 0 * 1.011 * 2 ^ 2
//	//s = 0,M = 1.011,E = 2
//	//0 10000001 01100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//40 b0 00 00
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	float f = 9.0f;
//	//1001
//	//1.001*2^3
//	//(-1) ^ 0 * 1.001 * 2 ^ 3
//	//0 10000010 00100000000000000000000
//	//0 10000010 00100000000000000000000
//  //0100 0001 0001 0000 0000 0000 0000 0000
//	//41 10 00 00
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	float f = 9.0f;
//	//1001.0
//	//1.001 * 2 ^ 3
//	//(-1) ^ 0 * 1.001 * 2 ^ 3
//	//0   10000010 00100000000000000000000
//	//正  130       
//	//0100 0001 0001 0000 0000 0000 0000 0000
//	//41   10        00        00
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	float f = 10.0f;
//	//1010.0
//	//1.01 * 2 ^ 3
//	//(-1) ^ 0 * 1.01 * 2 ^ 3
//	//0 10000010 01000000000000000000000
//	//0100 0001 0010 0000 0000 0000 0000 0000
//	//41 20 00 00
//	return 0;
//}